#include "CppUnitTest.h"
#include "../Medium/36. Valid Sudoku.cpp"
using namespace Microsoft::VisualStudio::CppUnitTestFramework;

namespace UnitTest
{
	TEST_CLASS(UT_36)
	{
	public:

		TEST_METHOD(TestMethod1)
		{
			// TODO: 在此输入测试代码
			Solution obj;
			vector<vector<char>> board{ { '5','3','.','.','7','.','.','.','.' },
															  {'6','.','.','1','9','5','.','.','.'} ,
															  {'.','9','8','.','.','.','.','6','.'},
															  {'8','.','.','.','6','.','.','.','3'},
															  {'4','.','.','8','.','3','.','.','1'},
															  {'7','.','.','.','2','.','.','.','6'},
															  {'.','6','.','.','.','.','2','8','.'},
															  {'.','.','.','4','1','9','.','.','5' },
															  {'.', '.', '.', '.', '8', '.', '.', '7', '9'} };

			Assert::IsTrue(obj.isValidSudoku(board) == true);
		}

		TEST_METHOD(TestMethod2)
		{
			// TODO: 在此输入测试代码
			Solution obj;
			vector<vector<char>> board{ { '8','3','.','.','7','.','.','.','.' },
															  {'6','.','.','1','9','5','.','.','.'} ,
															  {'.','9','8','.','.','.','.','6','.'},
															  {'8','.','.','.','6','.','.','.','3'},
															  {'4','.','.','8','.','3','.','.','1'},
															  {'7','.','.','.','2','.','.','.','6'},
															  {'.','6','.','.','.','.','2','8','.'},
															  {'.','.','.','4','1','9','.','.','5' },
															  {'.', '.', '.', '.', '8', '.', '.', '7', '9'} };

			Assert::IsTrue(obj.isValidSudoku(board) == false);
		}
	};
}